/*
 * QPlot - 2d plotting tool based on Qwt
 * File: "qplot.h"
 */
//----------------------------------------------------------------------------
#ifndef QPLOT_H
#define QPLOT_H
//----------------------------------------------------------------------------
#include "plot_area.h" // PlotArea
//----------------------------------------------------------------------------
extern std::string qplot_mission_file; // имя INI-файла задания
//----------------------------------------------------------------------------

//----------------------------------------------------------------------------
// демонстрационное построение графиков (если нет задания)
void qplot_demo(PlotArea *pa);
//----------------------------------------------------------------------------
#endif // QPLOT_H

/*** end of "qplot.h" file ***/

