/*
 * QPlot - 2d plotting tool based on Qwt
 * File: "qplot.h"
 */
//----------------------------------------------------------------------------
#ifndef QPLOT_H
#define QPLOT_H
//----------------------------------------------------------------------------
#include "plot_area.h" // PlotArea
//----------------------------------------------------------------------------
// постоить графики на основе файла задания
// (возвращает false, если ни одного графика не построено)
bool qplot_run(
  const char *mission_file, // имя INI-айла задания
  PlotArea   *pa);          // казатель на PlotArea : QwtPlot widget
//----------------------------------------------------------------------------
// демонстрационное построение графиков
void qplot_demo(PlotArea *pa);
//----------------------------------------------------------------------------
#endif // QPLOT_H

/*** end of "qplot.h" file ***/
